TexasInstruments/motor-control-sdk/examples/current_sense/icss_sdfm_nine_channel_load_share_snoop_mode/am243x-lp/r5fss0-0_freertos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM243x_ALX_beta" --part "ALX" --package "ALX" --context "r5fss0-0" --product "MOTOR_CONTROL_SDK@2025.00.00"
 * @v2CliArgs --device "AM2434" --package "FCCSP (ALX)" --context "r5fss0-0" --product "MOTOR_CONTROL_SDK@2025.00.00"
 * @versions {"tool":"1.23.0+4000"}
 */

/**
 * Import the modules used in this configuration.
 */
const sdfm              = scripting.addModule("/current_sense/sdfm", {}, false);
const sdfm1             = sdfm.addInstance();
const epwm              = scripting.addModule("/drivers/epwm/epwm", {}, false);
const epwm1             = epwm.addInstance();
const epwm2             = epwm.addInstance();
const gpio              = scripting.addModule("/drivers/gpio/gpio", {}, false);
const gpio1             = gpio.addInstance();
const gpio2             = gpio.addInstance();
const gpio3             = gpio.addInstance();
const pruicss           = scripting.addModule("/drivers/pruicss/pruicss", {}, false);
const pruicss1          = pruicss.addInstance();
const debug_log         = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg           = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7         = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71        = mpu_armv7.addInstance();
const mpu_armv72        = mpu_armv7.addInstance();
const mpu_armv73        = mpu_armv7.addInstance();
const mpu_armv74        = mpu_armv7.addInstance();
const mpu_armv75        = mpu_armv7.addInstance();
const default_linker    = scripting.addModule("/memory_configurator/default_linker", {}, false);
const default_linker1   = default_linker.addInstance();
const general           = scripting.addModule("/memory_configurator/general", {}, false);
const general1          = general.addInstance();
const region            = scripting.addModule("/memory_configurator/region", {}, false);
const region1           = region.addInstance();
const section           = scripting.addModule("/memory_configurator/section", {}, false);
const section1          = section.addInstance();
const section2          = section.addInstance();
const section3          = section.addInstance();
const section4          = section.addInstance();
const section5          = section.addInstance();
const section6          = section.addInstance();
const section7          = section.addInstance();
const section8          = section.addInstance();
const section9          = section.addInstance();
const section10         = section.addInstance();
const section11         = section.addInstance();
const section12         = section.addInstance();
const pruicss_g_v0_pwm  = scripting.addModule("/pruicss_g_v0_pwm/pruicss_g_v0_pwm", {}, false);
const pruicss_g_v0_pwm1 = pruicss_g_v0_pwm.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
sdfm1.$name                   = "CONFIG_SDFM0";
sdfm1.G_MUX_EN                = true;
sdfm1.Enable_Load_Share       = true;
sdfm1.PRU_EnableSnoopNC       = true;
sdfm1.PRU_EnableTriggerMode   = true;
sdfm1.RTU_EnableSnoopNC       = true;
sdfm1.RTU_EnableTriggerMode   = true;
sdfm1.TXPRU_EnableSnoopNC     = true;
sdfm1.TXPRU_EnableTriggerMode = true;
sdfm1.Enable_Channel_0        = true;
sdfm1.Enable_Channel_1        = true;
sdfm1.Enable_Channel_2        = true;
sdfm1.Enable_Channel_3        = true;
sdfm1.Enable_Channel_4        = true;
sdfm1.Enable_Channel_5        = true;
sdfm1.Enable_Channel_6        = true;
sdfm1.Enable_Channel_7        = true;
sdfm1.Enable_Channel_8        = true;
sdfm1.Enable_Epwm_Sync        = true;
sdfm1.PRU_SelectIepCmpEvent   = "3";
sdfm1.RTU_SelectIepCmpEvent   = "4";
sdfm1.TXPRU_SelectIepCmpEvent = "5";
sdfm1.PRU_ICSSG0_PRU.$assign  = "PRU_ICSSG0_PRU0";

epwm1.$name            = "CONFIG_EPWM0";
epwm1.EPWM.$assign     = "EHRPWM0";
epwm1.EPWM.SYNCI.$used = false;

epwm2.$name              = "CONFIG_EPWM1";
epwm2.EPWM.SYNCO.$assign = "GPMC0_AD1";
epwm2.EPWM.SYNCO.$used   = false;
epwm2.EPWM.SYNCI.$used   = false;

gpio1.pinDir         = "OUTPUT";
gpio1.$name          = "GPIO_ZC_TH_CH0";
gpio1.GPIO_n.$assign = "PRG1_PRU0_GPO18";

gpio2.pinDir         = "OUTPUT";
gpio2.$name          = "GPIO_ZC_TH_CH1";
gpio2.GPIO_n.$assign = "PRG0_PRU1_GPO2";

gpio3.pinDir         = "OUTPUT";
gpio3.$name          = "GPIO_ZC_TH_CH2";
gpio3.GPIO_n.$assign = "PRG0_PRU1_GPO1";

debug_log.enableUartLog        = true;
debug_log.uartLog.$name        = "CONFIG_UART_CONSOLE";
debug_log.uartLog.UART.$assign = "USART0";

const uart_v0_template  = scripting.addModule("/drivers/uart/v0/uart_v0_template", {}, false);
const uart_v0_template1 = uart_v0_template.addInstance({}, false);
uart_v0_template1.$name = "drivers_uart_v0_uart_v0_template0";
debug_log.uartLog.child = uart_v0_template1;

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

mpu_armv72.$name             = "CONFIG_MPU_REGION1";
mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr          = 0x41010000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv73.attributes        = "Cached+Sharable";

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 21;

mpu_armv75.$name             = "CONFIG_MPU_REGION4";
mpu_armv75.baseAddr          = 0x60000000;
mpu_armv75.size              = 28;
mpu_armv75.accessPermissions = "Supervisor RD, User RD";

default_linker1.$name = "memory_configurator_default_linker0";

general1.$name        = "CONFIG_GENERAL0";
general1.linker.$name = "TIARMCLANG0";

